stress_test/killer.yml
config:
  target: "http://localhost:7111"
  phases:
    - duration: 5
      arrivalRate: 20
    - duration: 30
      arrivalRate: 20
      rampTo: 200
      name: "Warmup"
    - duration: 30
      arrivalRate: 200
      rampTo: 600
      name: "Ramping up arrival rate"
    - duration: 40
      arrivalRate: 900
      name: "Final load phase"

  processor: "./randomData.js"
scenarios:
  - name: "Find song"
    weight: 49
    flow:
      # - loop:
        - function: "generateRandomData"
        - get:
            url: "/songs/{{ songId }}"
        # - think: 1
        # count: 50
  - name: "Submit song"
    weight: 1
    flow:
      # - loop:
        - function: "generateRandomData"
        - post :
            url: "/api/songs/"
            json:
              title: "{{ title }}"
              artist: "{{ artist }}"
              genre: "{{ title }}"
              album: "{{ title }}"
              albumart: "{{ url }}"
              songfile: "{{ url }}"
              createdat: "{{ songId }}"
        - log: "Target ID {{ songId }} executed"
        # - think: 1
        # count: 50